            //--------------------------------------------------task 1--------------------------------------------------
            let a = 10;
            alert(a);
            a = 20;
            alert(a);

            //--------------------------------------------------task 2--------------------------------------------------
            const yearFirstIPhone = 2007;
            alert(yearFirstIPhone);

            //--------------------------------------------------task 3--------------------------------------------------
            const BrendanEich  = 'Брендан Эйх';
            alert(BrendanEich);

            //--------------------------------------------------task 4--------------------------------------------------
            let num1 = 10;
            let num2 = 2;
            let summa = num1 + num2;
            let difference = num1 - num2;
            let product = num1 * num2;
            let quotient = num1 / num2;
            alert((`Сумма ${num1} и ${num2} = ` + summa + '\n') + (`Разность ${num1} и ${num2} = `  + difference + '\n') +
                (`Произведение ${num1} и ${num2} = `  +  product + '\n') + (`Кратное при делении ${num1} и ${num2} = ` +
                quotient));

            //--------------------------------------------------task 5--------------------------------------------------
            let result = 2 ** 5;
            alert(result);

            //--------------------------------------------------task 6--------------------------------------------------
            a = 9;
            let b = 2;
            alert(a % b);

            //--------------------------------------------------task 7--------------------------------------------------
            let num = 1;
            num += 5;
            num -= 3;
            num *= 7;
            num /= 3;
            num++;
            num--;
            alert(num);

            //--------------------------------------------------task 8--------------------------------------------------
            let age = Number(prompt('Сколько вам лет?'));
            count = age % 100;
            if (count >= 5 && count <= 20) {
		    age = `Вам ${age} лет!`;
	        } else {
		    count = age % 10;
		    if (count == 1) {
			age = `Вам ${age} год!`;
		    } else if (count >= 2 && count <= 4) {
			age = `Вам ${age} года!`;
		    } else {
			age = `Вам ${age} лет!`;
		    }
	        }
            alert(age);

            //-------------------------------------------------task 9.0-------------------------------------------------
            let user = {
                name: "Anvar",
                age: 24,
                isAdmin: true
            };

            //-------------------------------------------------task 9.1-------------------------------------------------
            user['city of residence'] = 'Saratov region';

            //-------------------------------------------------task 9.2-------------------------------------------------
            user['age'] = 24;

            //-------------------------------------------------task 9.3-------------------------------------------------
            delete user['city of residence'];

            //-------------------------------------------------task 9.4-------------------------------------------------
            let info = prompt('Какую информацию хотите узнать о пользователе?', 'name');
            alert(user[info]);

            //-------------------------------------------------task 10--------------------------------------------------
            let whatsYourName = prompt('Введите Ваше имя');
            alert('Привет, ' + whatsYourName.toUpperCase() + '!');