//--------------------------------------------------task 1--------------------------------------------------
// for (let index = 0; index < 2; index++) {
//     console.log("Привет!");
//     console.log(index);
    
// }

//--------------------------------------------------task 2--------------------------------------------------
// for (let index = 1; index < 6; index++) {
//     console.log(index);
    
// }

//--------------------------------------------------task 3--------------------------------------------------
// for (let index = 7; index <= 22; index++) {
//     console.log(index);
    
// }
//--------------------------------------------------task 4--------------------------------------------------
// const obj = {
//     "Коля": '200',
//     "Вася": '300',
//     "Петя": '400'
// }
// for (const key in obj) {
//    console.log(` ${key} — зарплата ${obj[key]} долларов`);
// }
//--------------------------------------------------task 5--------------------------------------------------


// let n = 1000;
// let num = 0;
// while (n >= 50) {
//     n /= 2;
//     num++
    
// }
//     console.log(`Число ${n}`);
//     console.log(`Операций ${num}`);
//--------------------------------------------------task 6--------------------------------------------------
let firstFridfay = 2;

for (let day = firstFridfay; day <= 31; day += 7) {
    console.log(`Сегодня пятница, ${day}-е число. Необходимо подготовить отчет.`);
    
    
}

